Revit 2027 API
Color.Green Property
Get the green channel of the color. Setting a channel is obsolete in Autodesk Revit 2013. Please create a new color instead.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public byte Green { get; set; }
Public Property Green As Byte
	Get
	Set
public:
property unsigned char Green {
	unsigned char get ();
	void set (unsigned char value);
}
member Green : byte with get, set
Property Value
Byte
Exceptions
Exception | Condition
InvalidOperationException | When getting the value: the color is invalid or uninitialized.
See Also
Reference
Color Class
Autodesk.Revit.DB Namespace